
Функция СтавкаРефинансирования(Период) Экспорт 
	
	ЗначениеВозврата = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиРефинансированияСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.СтавкиРефинансирования.СрезПоследних(КонецПериода(&Период, ДЕНЬ), ) КАК СтавкиРефинансированияСрезПоследних
		|//ГДЕ
		|//	СтавкиРефинансированияСрезПоследних.СтавкаРефинансирования = &СтавкаРефинансирования";
	//   
	СтавкаРефинансирования = Справочники.СтавкаРефинансирования.ПустаяСсылка();
	Запрос.УстановитьПараметр("СтавкаРефинансирования", СтавкаРефинансирования); 
	Запрос.УстановитьПараметр("Период", Период);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗначениеВозврата = ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;
	
	Возврат ЗначениеВозврата;
	
КонецФункции