
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти 

#Область ОбрабочикиСобытийЭлементовФормы

&НаКлиенте
Процедура Субконто2ПриИзменении(Элемент)
	ЗаполнитьДокументПоСубконтоНаСервере();
	УстановитьКурсКратность();
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	УстановитьКурсКратность();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Инициализация

#КонецОбласти

&НаКлиенте
Процедура УстановитьКурсКратность()
	
	Значение = ПолучитьПарамерыВалютыНаСервере(Объект.Валюта, Объект.Дата);
	Объект.Курс = Значение.Курс;
	Объект.Кратность = Значение.Кратность;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПарамерыВалютыНаСервере(ВалютаСсылка, Период) 
	Возврат РегистрыСведений.КурсыВалют.ПолучитьПараметрыВалюты(ВалютаСсылка, Период);
КонецФункции

&НаСервере
Процедура ЗаполнитьДокументПоСубконтоНаСервере()
	
	//Представим,что тут умная обертка для разных видов операций
	Если Объект.ЭтоРасчетыПоЗайму Тогда 
		
		ПараметрыРасчетаДоговораЗайма = Документы.ДоговорЗайма.ПолучитьПараметрыРасчета(Объект.Субконто2, Объект.Дата);
		Если НЕ Объект.ЭтоОперацияВыплатыПроцентов Тогда
			Объект.СчетРасчетов = ПараметрыРасчетаДоговораЗайма.СчетУчета;	
			Объект.Сумма = ПараметрыРасчетаДоговораЗайма.СуммаЗайма;
		Иначе 
			Объект.СчетРасчетов = ПараметрыРасчетаДоговораЗайма.СчетУчетаПроцентов;	
			Объект.Сумма = ПараметрыРасчетаДоговораЗайма.СуммаПроцентовНачислено;
		КонецЕсли;
		
		Объект.Валюта = ПараметрыРасчетаДоговораЗайма.Валюта;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
