#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ);
	ПодготовитьТаблицыДляДвижений(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ);
	СформироватьДвиженияВРегистры(ДополнительныеСвойства, Движения, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ) Экспорт 
	
	ДополнительныеСвойства.Вставить("ВалютаРегУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
КонецПроцедуры

Процедура ПодготовитьТаблицыДляДвижений(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ) Экспорт
	
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", новый Структура());
	
	ПодготовитьТаблицыДляДвижений_ПараметрыДоговораЗайма(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ);	
	//ПодготовитьТаблицыДляДвижений_ПараметрыДоговораЗаймаАгент(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ);	
	
КонецПроцедуры

Процедура ПодготовитьТаблицыДляДвижений_ПараметрыДоговораЗайма(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ) Экспорт
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ПараметрыДоговораЗайма", Новый ТаблицаЗначений);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка); 
	Запрос.УстановитьПараметр("ДоговорЗайма", Ссылка.ДокументОснование);
	Запрос.УстановитьПараметр("Организация", Ссылка.ДокументОснование.Организация);
	Запрос.УстановитьПараметр("Контрагент", Ссылка.ДокументОснование.Контрагент);
	Запрос.УстановитьПараметр("Период", КонецДня(Ссылка.ДатаЗакрытияДоговора) - 1);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОНЕЦПЕРИОДА(ДокументЗакрытия.ДатаЗакрытияДоговора, ДЕНЬ) КАК Период,
	               |	ПараметрыДоговора.Организация КАК Организация,
	               |	ПараметрыДоговора.Контрагент КАК Контрагент,
	               |	ПараметрыДоговора.ДоговорЗайма КАК ДоговорЗайма,
	               |	ПараметрыДоговора.ДатаНачала КАК ДатаНачала,
	               |	КОНЕЦПЕРИОДА(ДокументЗакрытия.ДатаЗакрытияДоговора, ДЕНЬ) КАК ДатаОкончания,
	               |	ПараметрыДоговора.Валюта КАК Валюта,
	               |	ПараметрыДоговора.СчетУчета КАК СчетУчета,
	               |	ПараметрыДоговора.СчетУчетаПроцентов КАК СчетУчетаПроцентов,
	               |	ПараметрыДоговора.Процент КАК Процент,
	               |	ДокументЗакрытия.Сумма КАК СуммаЗайма,
	               |	ДокументЗакрытия.СуммаПроцента КАК СуммаПроцентовНачислено,
	               |	ИСТИНА КАК Состояние
	               |ИЗ
	               |	Документ.ЗакрытиеДоговораЗайма КАК ДокументЗакрытия
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыДоговораЗайма.СрезПоследних(
	               |				&Период,
	               |				Организация = &Организация
	               |					И Контрагент = &Контрагент
	               |					И ДоговорЗайма = &ДоговорЗайма) КАК ПараметрыДоговора
	               |		ПО ДокументЗакрытия.ДокументОснование = ПараметрыДоговора.ДоговорЗайма
	               |ГДЕ
	               |	ДокументЗакрытия.Ссылка = &ДокументСсылка";
	//
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выгрузить();
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ПараметрыДоговораЗайма", Выборка);
	
КонецПроцедуры

Процедура СформироватьДвиженияВРегистры(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаДвижений = ДополнительныеСвойства.ТаблицыДляДвижений.ПараметрыДоговораЗайма;
	Если ТаблицаДвижений.Количество() > 0 Тогда
		Движения.ПараметрыДоговораЗайма.Записывать = Истина;
		Движения.ПараметрыДоговораЗайма.Загрузить(ТаблицаДвижений);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли