
Функция ПолучитьДанныеРасчета(ДокументСсылка, ПериодОкончания) Экспорт 
	
	ВалютаРегУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОбороты.Счет КАК Счет,
		|	ХозрасчетныйОбороты.Субконто1 КАК Контрагент,
		|	ХозрасчетныйОбороты.Субконто2 КАК ДоговорЗайма,
		|	ХозрасчетныйОбороты.Регистратор КАК Документ,
		|	НАЧАЛОПЕРИОДА(ХозрасчетныйОбороты.Период, ДЕНЬ) КАК Дата,
		|	ВЫБОР
		|		КОГДА НЕ &ВВалюте
		|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|		ИНАЧЕ ХозрасчетныйОбороты.СуммаВалютаОборотКт
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			,
		|			&ПериодОкончания,
		|			Регистратор,
		|			Счет В ИЕРАРХИИ (&Счет),
		|			&Субконто,
		|			Организация = &Организация
		|				И Субконто1 = &Контрагент
		|				И Субконто2 = &ДоговорЗайма,
		|			,
		|			) КАК ХозрасчетныйОбороты";
	//                        
	Запрос.УстановитьПараметр("ДоговорЗайма", ДокументСсылка);
	Запрос.УстановитьПараметр("Контрагент", ДокументСсылка.Контрагент);
	Запрос.УстановитьПараметр("Организация", ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("ПериодОкончания", ПериодОкончания); 
	
	Запрос.УстановитьПараметр("ВВалюте", ВалютаРегУчета <> ДокументСсылка.Валюта);
	
	Субконто = Новый Массив;
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты); 
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ДоговорЗайма);
	Запрос.УстановитьПараметр("Субконто", Субконто);
	
	Запрос.УстановитьПараметр("Счет", ДокументСсылка.СчетУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	ЗначениеВозврата = РезультатЗапроса.Выгрузить();
	
	Возврат ЗначениеВозврата;
	
КонецФункции