
Функция ПолучитьПараметрыВалюты(ВалютаСсылка, Период) Экспорт 
	
	ЗначениеВозврата = Новый Структура("Валюта, Курс, Кратность", ВалютаСсылка, 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Значение КАК Курс,
		|	КурсыВалютСрезПоследних.Кратность КАК Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаСсылка) КАК КурсыВалютСрезПоследних";
	//
	Запрос.УстановитьПараметр("ВалютаСсылка", ВалютаСсылка);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЗначениеВозврата, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Возврат ЗначениеВозврата;
	
КонецФункции