
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//тут представим,что я развел все в "обертки" обнолвения формы
	УстановитьПредставлениеПериода();

КонецПроцедуры

#КонецОбласти 

#Область ОбрабочикиСобытийЭлементовФормы
  
&НаКлиенте
Процедура ПериодЗаймаПриИзменении(Элемент)
	
	УстановитьДатуНачалоОкончанияЗайма(ПериодЗайма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Инициализация

#КонецОбласти

&НаКлиенте
Процедура УстановитьДатуНачалоОкончанияЗайма(Значение)
	
	Объект.ДатаНачала = Значение.ДатаНачала;
	Объект.ДатаОкончания = Значение.ДатаОкончания;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредставлениеПериода()
	
	ПериодЗайма.ДатаНачала = Объект.ДатаНачала;
	ПериодЗайма.ДатаОкончания = Объект.ДатаОкончания;
	
КонецПроцедуры

#КонецОбласти
