#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ);
	ПодготовитьТаблицыДляДвижений(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ);
	СформироватьДвиженияВРегистры(ДополнительныеСвойства, Движения, Отказ);
	
	СформироватьДвиженияХозрасчетный(ДополнительныеСвойства, Движения, Отказ)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ) Экспорт 
	
	ДополнительныеСвойства.Вставить("ВалютаРегУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
КонецПроцедуры

Процедура ПодготовитьТаблицыДляДвижений(Ссылка, ДополнительныеСвойства, РежимПроведения, Отказ) Экспорт

КонецПроцедуры

Процедура СформироватьДвиженияВРегистры(ДополнительныеСвойства, Движения, Отказ) Экспорт

КонецПроцедуры

Процедура СформироватьДвиженияХозрасчетный(ДополнительныеСвойства, Движения, Отказ) Экспорт 
	Хозрасчетный = Движения.Хозрасчетный;

	//тут в БУ модуль по определению счета банк, упростим
	СчетБанк = ПланыСчетов.Хозрасчетный.РасчетныеСчета; 
	Если ДополнительныеСвойства.ВалютаРегУчета <> Валюта Тогда 
		СчетБанк = ПланыСчетов.Хозрасчетный.ВалютныеСчета;
	КонецЕсли;                                            
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Документ.Дата КАК Период,
		|	Документ.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА Документ.Валюта <> &ВалютаРегУчета
		|			ТОГДА Документ.Валюта
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|	КОНЕЦ КАК ВалютаДт,
		|	ВЫБОР
		|		КОГДА Документ.Валюта <> &ВалютаРегУчета
		|			ТОГДА Документ.Валюта
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|	КОНЕЦ КАК ВалютаКт,
		|	&СчетБанк КАК СчетКт,
		|	Документ.СчетОрганизации КАК СубконтоКт1,
		|	Документ.СчетРасчетов КАК СчетДт,
		|	Документ.Контрагент КАК СубконтоДт1,
		|	Документ.Субконто2 КАК СубконтоДт2,
		|	ВЫБОР
		|		КОГДА Документ.Валюта = &ВалютаРегУчета
		|			ТОГДА Документ.Сумма
		|		ИНАЧЕ Документ.Сумма * Документ.Курс * Документ.Кратность
		|	КОНЕЦ КАК Сумма, 
		|	ВЫБОР
		|		КОГДА Документ.Валюта = &ВалютаРегУчета
		|			ТОГДА Документ.Сумма
		|		ИНАЧЕ Документ.Сумма * Документ.Курс * Документ.Кратность
		|	КОНЕЦ КАК СуммаНУ,
		|	ВЫБОР
		|		КОГДА Документ.Валюта = &ВалютаРегУчета
		|			ТОГДА 0
		|		ИНАЧЕ Документ.Сумма
		|	КОНЕЦ КАК СуммаВалютаДт
		|ИЗ
		|	Документ.СписаниеСРасчетногоСчета КАК Документ
		|ГДЕ
		|	Документ.Ссылка = &Ссылка
		|	И Документ.ЭтоРасчетыПоЗайму = ИСТИНА";
	//
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СчетБанк", СчетБанк);
	Запрос.УстановитьПараметр("ВалютаРегУчета", ДополнительныеСвойства.ВалютаРегУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВДЗ = РезультатЗапроса.Выбрать();
	
	Пока ВДЗ.Следующий() Цикл
		СтрД = Хозрасчетный.Добавить();
		ЗаполнитьЗначенияСвойств(СтрД, ВДЗ);
		
		//в БУХ ТУТ универсальная обработка установки субконто. Имитируем
		Для Индекс = 1 ПО 3 Цикл
			ЗначениеСубконто = Неопределено;
			Если РезультатЗапроса.Колонки.Найти("СубконтоДт" + Индекс) <> Неопределено Тогда
				ЗначениеСубконто = ВДЗ["СубконтоДт" + Индекс];		
			КонецЕсли; 
			Если ЗначениеСубконто = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Для каждого Субконто Из СтрД.СчетДт.ВидыСубконто Цикл 
				
				Если Субконто.ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеСубконто)) Тогда
					СтрД.СубконтоДт.Вставить(Субконто.ВидСубконто, ЗначениеСубконто)	
				КонецЕсли;
			КонецЦикла;			
	
		КонецЦикла;	
		Для Индекс = 1 ПО 3 Цикл
			ЗначениеСубконто = Неопределено;
			Если РезультатЗапроса.Колонки.Найти("СубконтоКт" + Индекс) <> Неопределено Тогда
				ЗначениеСубконто = ВДЗ["СубконтоКт" + Индекс];		
			КонецЕсли;  
			Если ЗначениеСубконто = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Для каждого Субконто Из СтрД.СчетКт.ВидыСубконто Цикл 
				
				Если Субконто.ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеСубконто)) Тогда
					СтрД.СубконтоКт.Вставить(Субконто.ВидСубконто, ЗначениеСубконто)	
				КонецЕсли;
			КонецЦикла;			
		КонецЦикла;

	КонецЦикла;
	
	ПереоценкаВалютныхСчетов(Ссылка, Хозрасчетный, ДополнительныеСвойства);
	
	Хозрасчетный.Записывать = Истина;
КонецПроцедуры

Функция ПереоценкаВалютныхСчетов(ДокументСсылка, Хозрасчетный, ДополнительныеСвойства)
	ЗначениеВозврата = Ложь;
	
	Если ДокументСсылка.Валюта = ДополнительныеСвойства.ВалютаРегУчета Тогда
		Возврат ЗначениеВозврата;		
	КонецЕсли;
	
	
	
	
	Возврат ЗначениеВозврата;
КонецФункции

#КонецОбласти

#КонецЕсли