
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти 

#Область ОбрабочикиСобытийЭлементовФормы

&НаКлиенте
Процедура Субконто2ПриИзменении(Элемент)
	//А тут должно быть заполнение параметров платежного документа
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	УстановитьКурсКратность();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Инициализация

#КонецОбласти

&НаКлиенте
Процедура УстановитьКурсКратность()
	
	Значение = ПолучитьПарамерыВалютыНаСервере(Объект.Валюта, Объект.Дата);
	Объект.Курс = Значение.Курс;
	Объект.Кратность = Значение.Кратность;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПарамерыВалютыНаСервере(ВалютаСсылка, Период) 
	Возврат РегистрыСведений.КурсыВалют.ПолучитьПараметрыВалюты(ВалютаСсылка, Период);
КонецФункции

#КонецОбласти
